{
    "main": {
        "memberDiscord": "You need to be a member of our Discord server to use our API - https://discloud.app",
        "notApp": "You don't have any app",
        "file": "Mandatory File",
        "getBackup": "A flaw occurred when trying to get your application backuo files.",
        "maxGB": "Your application backup files exceeds 1GB",
        "appExe": "The application has already a process in execution.",
        "idApp": "This id does not belong to any of your applications.",
        "todosParameter": "The All parameter is not supported on this route.",
        "appRemove": "Your application has been removed.",
        "notMod":"You don't belong to any team of the app {{app}}"
    },
    "routes": {
        "upload":{
            "rar":"The extension {{file}} is not supported, use the .zip extension.",
            "app": "Your app has been started",
            "webApp": "Your web application has been started -",
        "erro": {
            "93": "The discloud.config file was not found within .zip sent.",
            "403": "We found an error inside discloud.config file, make sure it has placed the information correctly.",
            "91": "An error occurred when allocating the space. Verify that the zip file you sent is not corrupted, valid or blocked with a password.",
            "typeApp": "Enter what type of application is on your discloud.config",
            "mainFile": "The main file informed in discloud.config is incorrect.",
            "fileMain": "Enter what is the application's main file on your discloud.config",
            "ram": "Enter your application RAM on your discloud.config",
            "limitHost": "You have reached the application's limit for your plan.",
            "appLimit": "You have reached the application limit you can host or you allocated all available RAM of your plan.",
            "ramValue": "RAM must be a value above 100MB",
            "appHost": "You can only host one application on the free plane.",
            "allocating": "An error occurred by allocating the space. Verify that the Zip file you sent is not corrupted, valid or blocked with a password.",
            "configAmb": "An error occurred when configuring the environment. Contact someone from the team to solve this error.",
            "lanNumber": "An error occurred when configuring the LanNumber environment. Contact someone from the team to solve this error.",
            "subdomain": "Add the subdominium of your site to the ID field to your discloud.config",
            "website": "The website system is only available for `platinum` or upper planes.",
            "approve": "You still have no approved or available subdomain for use.",
            "mbMin": "You need to have at least 512MB of memory available to upload your application.",
            "mbMax": "The value of the RAM of your application must be 512MB or more.",
            "read": "Error trying to read the discloud.config file",
            "idApp": "ID {{app}} belongs to an application that is already hosting.",
            
            "ramLimit": "The RAM limit of your plan is {{plans}} mb",
            "freeHost": "You need to have at least {{mem}}MB free to host an application and you are using, if you don't have one of our plans yet, get a plan to release more features.",
            "botLang": "An error has occurred. We do not detect {{botlang}} in the directory of your application.",
            "erroFile": "We identified an error in your file {{langbot}}, correct it and try again.",
            "lastMemory": "You cannot put this amount of memory in your application, only you remain {{mem}} MB",
            "siteLang": "An error has occurred.We do not detect {{sitelang}} in the directory of your application.",
            "siteErro": "We identified an error in your file {{siteLang}}, correct it and try again.",
            "subDomain": "You did not register the {{subDomain}} subdomain."
        } 
        },
        "user":{
            "userData": "User data were successfully charged"
        },
        "locale":{
            "error":"The translation into language {{lang}} does not yet exist.",
            "msg":"You will be answered in english by Discloud from now."
        },
        "app": {
            "allApps": "The information from your applications has been loaded.",
            "oneApp": "The information of your application has been loaded.",
            "notOwner": "This id does not belong to any of its applications.",
            
            "backup":{
                "backupLoad": "The backups of your applications were loaded",
                "backupOk": "The backup of your application will be generated successfully"
            },
            "commit":{
                "200": "The files of your application have been successfully updated.",
                "201": "Error when rebuildar and renight the container.",
                "204": "The .rar extension is not compatible, use the .zip extension.",
                "222": "Your application cannot be started because a fault in your code has been detected, check the application logs for more details.",
                "302": "An error occurred when configuring your environment.",
                "404": "An error occurred when downloading the file you sent, make sure the file is not corrupted and try again.",
                "504": "We identified an error in your file {{file}}, correct it and try again."
            },
            "logs":{
                "logsLoad": "The logs of your applications were loaded"
            },
            "ram":{
                "changeMem": "Changing the memory used by applications is only available for Carbon or superior donors.",
                "ramOk": "The memory of your application has been successfully changed.",

                "erro": {
                    "value": "Amount of invalid RAM.",
                    "botRam": "RAM must be a value equal to or above 100MB.",
                    "webRam": "Web applications need at least 512MB.",
                    "changeMem": "An error occurred when trying to change the memory of its application."
                }
            },
            "restart":{
                "appRestart": "Its application was restarted.",
                "appOff": "Its application is already off.",

                "erro": {
                    "erroApp": "Error when restarting your application.",
                    "erroRestart": "An error occurred when restarting its application.",
                    "erroDependencies": "An error of dependencies occurred when restarting its application."
                }
            },
            "start":{
                "appConnect": "Its application was connected.",
                "appOn": "Its application is already on.",
                "appLink": "Its application has been linked.",

                "erro": {
                    "erroStart": "An error occurred when starting its application.",
                    "erroDependencies": "An error of dependencies occurred when starting its application."
                }
            },
            "status":{
                "statusApp": "The status of your applications were loaded"
            },
            "stop":{
                "stoping": "Your application has been turned off"
            },
            "apt":{
                "not":"There are no packages available for this language",
                "aptNot": "There are no packages available with that name",
                "errorNewApt": "We detected an error by setting up the new packages.",
                "install": "The {{newpt}} package was installed",
                "del": "The package {{Newapt}} was uninstalled"
            },
            "team":{
                "appTeam": "You are not on any app team",
                "modAppRemove": "Moderator removed from the application",
                "modd": "This moderator has already been registered.",
                
                "erro": {
                    "modPlan": "The moderators system is only available for gold or higher donors.",
                    "appMod": "This application has already reached as much moderators as possible.",
                    "arrayPerm": "Variavel perms needs to be an array of permissions",
                    "modOwn": "You cannot add as a moderator in your own application.",
                    "notMod": "This moderator does not exist in this app"
                }
            }
        },
        "team":{
            "backup":{},
            "commit":{},
            "delete": {},
            "logs":{ 
            },
            "ram":{},
            "restart":{},
            "start":{},
            "status":{},
            "stop":{
                "appOff": "Its application was off."
            }
        }
    }
}
